In [1]:
import pandas as pd # importa a biblioteca

In [2]:
# Exercício 1: Criar um dataframe utilizando a biblioteca pandas
Dicionario_01 = {
    'Nomes':["Alice",'Julia','Bruna','Daniel','Filipe','Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissões':['Direito','Engenharia','Enfermagem','Engenheiro Civil', 'Cientista da Computação', 'Engenheiro Eletrônico'],
    'ID':[1,2,3,4,5,6]
}
label_01 = ['1ªLinha','2ªLinha','3ªLinha','4ªLinha','5ªLinha','6ªLinha']

In [3]:
#Criando o dataframe
df1 = pd.DataFrame(Dicionario_01, index=label_01)

In [5]:
df1.head() # exibe as 4 primeiras linhas

          Nomes  Idade               Profissões  ID
1ªLinha   Alice     19                  Direito   1
2ªLinha   Julia     22               Engenharia   2
3ªLinha   Bruna     28               Enfermagem   3
4ªLinha  Daniel     34         Engenheiro Civil   4
5ªLinha  Filipe     28  Cientista da Computação   5
6ªLinha  Silvio     48    Engenheiro Eletrônico   6

In [14]:
# Exercício 2: Criar um dataframe utilizando a biblioteca pandas
Dicionario_02 = {
    'Números de produtos fabricados':[50,30,40,100],
    'Setores':[1,2,3,4]
}
label_02 = ['1ªLinha','2ªLinha','3ªLinha','4ªLinha']

In [15]:
#Criando o dataframe
df2 = pd.DataFrame(Dicionario_02, index=label_02)

In [16]:
df2.head()

         Números de produtos fabricados  Setores
1ªLinha                              50        1
2ªLinha                              30        2
3ªLinha                              40        3
4ªLinha                             100        4

In [17]:
# Exercício 3: Você tem disponível dois conjuntos de dados, um com o ID, nome dos funcionários e setores, o outro com 
# id e o salário dos funcionários. Juntar os dois dataframes utilizando a função merge para transformar em um 
# único dataframe utilizando a função merge
Dicionario_03 = {
    'ID':[1,2,3,4],
    'Nome':['Ana','Pedro','Maria','João'],
    'Setores':['Rh','Vendas','Administrativo','Produção']
}
Dicionario_04 = {
    'ID':[1,2,3,4],
    'Salários':[3000,2800,3200,2500]
}
label_03 = ['1ªLinha','2ªLinha','3ªLinha','4ªLinha']

In [18]:
#Criando os dataframes
df3 = pd.DataFrame(Dicionario_03, index=label_03)
df4 = pd.DataFrame(Dicionario_04, index=label_03)

In [19]:
df3.head()

         ID   Nome         Setores
1ªLinha   1    Ana              Rh
2ªLinha   2  Pedro          Vendas
3ªLinha   3  Maria  Administrativo
4ªLinha   4   João        Produção

In [20]:
df4.head()

         ID  Salários
1ªLinha   1      3000
2ªLinha   2      2800
3ªLinha   3      3200
4ªLinha   4      2500

In [21]:
df_n5 = pd.merge(df3,df4, how='right',on='ID')

In [22]:
df_n5.head()

   ID   Nome         Setores  Salários
0   1    Ana              Rh      3000
1   2  Pedro          Vendas      2800
2   3  Maria  Administrativo      3200
3   4   João        Produção      2500

In [27]:
#Exercício 4 Criar dois dataframes com dados de vendas de uma empresa
Dicionario_06 ={
    'Data':["01-01-2023","01-02-2023","01-03-2023"],
    'Produto':["Item A","Item B","Item A"],
    'Quantidade':[10,5,8],
    'Valor':[100.00,50.00,80.00]
}
Dicionario_07 ={
    'Data':["01-02-2023","02-02-2023","03-02-2023"],
    'Produto':["Item C","Item B","Item D"],
    'Quantidade':[12,6,3],
    'Valor':[120.00,60.00,30.00]
}
label_06 = ['1ªLinha','2ªLinha','3ªLinha']

In [28]:
#Criando os dataframes
df6 = pd.DataFrame(Dicionario_06, index=label_06)
df7 = pd.DataFrame(Dicionario_07, index=label_06)

In [29]:
df6.head()

               Data Produto  Quantidade  Valor
1ªLinha  01-01-2023  Item A          10  100.0
2ªLinha  01-02-2023  Item B           5   50.0
3ªLinha  01-03-2023  Item A           8   80.0

In [30]:
df7.head()

               Data Produto  Quantidade  Valor
1ªLinha  01-02-2023  Item C          12  120.0
2ªLinha  02-02-2023  Item B           6   60.0
3ªLinha  03-02-2023  Item D           3   30.0